sanhab-templates/document/wsdl/FirLogicV4_2Test.xml

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions name="FirPlcy" targetNamespace="http://tempuri.org/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:tns="http://tempuri.org/" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata"><wsdl:types><xsd:schema targetNamespace="http://tempuri.org/Imports"><xsd:import schemaLocation="http://reinsure.centinsur.ir/FirLogicV4_2Test?xsd=xsd2" namespace="http://tempuri.org/"/><xsd:import schemaLocation="http://reinsure.centinsur.ir/FirLogicV4_2Test?xsd=xsd0" namespace="http://schemas.microsoft.com/2003/10/Serialization/"/><xsd:import schemaLocation="http://reinsure.centinsur.ir/FirLogicV4_2Test?xsd=xsd1" namespace="http://schemas.datacontract.org/2004/07/System"/><xsd:import schemaLocation="http://reinsure.centinsur.ir/FirLogicV4_2Test?xsd=xsd3" namespace="http://schemas.datacontract.org/2004/07/FirLogic.DataModel"/><xsd:import schemaLocation="http://reinsure.centinsur.ir/FirLogicV4_2Test?xsd=xsd4" namespace="http://schemas.microsoft.com/2003/10/Serialization/Arrays"/></xsd:schema></wsdl:types><wsdl:message name="IFirPlcy_CiiRegPlcy_InputMessage"><wsdl:part name="parameters" element="tns:CiiRegPlcy"/></wsdl:message><wsdl:message name="IFirPlcy_CiiRegPlcy_OutputMessage"><wsdl:part name="parameters" element="tns:CiiRegPlcyResponse"/></wsdl:message><wsdl:message name="IFirPlcy_CiiRegDocLos_InputMessage"><wsdl:part name="parameters" element="tns:CiiRegDocLos"/></wsdl:message><wsdl:message name="IFirPlcy_CiiRegDocLos_OutputMessage"><wsdl:part name="parameters" element="tns:CiiRegDocLosResponse"/></wsdl:message><wsdl:message name="IFirPlcy_CiiRegDocLosSts_InputMessage"><wsdl:part name="parameters" element="tns:CiiRegDocLosSts"/></wsdl:message><wsdl:message name="IFirPlcy_CiiRegDocLosSts_OutputMessage"><wsdl:part name="parameters" element="tns:CiiRegDocLosStsResponse"/></wsdl:message><wsdl:message name="IFirPlcy_CiiRegDocLosEvl_InputMessage"><wsdl:part name="parameters" element="tns:CiiRegDocLosEvl"/></wsdl:message><wsdl:message name="IFirPlcy_CiiRegDocLosEvl_OutputMessage"><wsdl:part name="parameters" element="tns:CiiRegDocLosEvlResponse"/></wsdl:message><wsdl:message name="IFirPlcy_CiiRegLos_InputMessage"><wsdl:part name="parameters" element="tns:CiiRegLos"/></wsdl:message><wsdl:message name="IFirPlcy_CiiRegLos_OutputMessage"><wsdl:part name="parameters" element="tns:CiiRegLosResponse"/></wsdl:message><wsdl:message name="IFirPlcy_CiiRegLosOs_InputMessage"><wsdl:part name="parameters" element="tns:CiiRegLosOs"/></wsdl:message><wsdl:message name="IFirPlcy_CiiRegLosOs_OutputMessage"><wsdl:part name="parameters" element="tns:CiiRegLosOsResponse"/></wsdl:message><wsdl:message name="IFirPlcy_CiiRegCmpCntrct_InputMessage"><wsdl:part name="parameters" element="tns:CiiRegCmpCntrct"/></wsdl:message><wsdl:message name="IFirPlcy_CiiRegCmpCntrct_OutputMessage"><wsdl:part name="parameters" element="tns:CiiRegCmpCntrctResponse"/></wsdl:message><wsdl:message name="IFirPlcy_CiiRegPlcyTrn_InputMessage"><wsdl:part name="parameters" element="tns:CiiRegPlcyTrn"/></wsdl:message><wsdl:message name="IFirPlcy_CiiRegPlcyTrn_OutputMessage"><wsdl:part name="parameters" element="tns:CiiRegPlcyTrnResponse"/></wsdl:message><wsdl:message name="IFirPlcy_CiiRegPlcyPay_InputMessage"><wsdl:part name="parameters" element="tns:CiiRegPlcyPay"/></wsdl:message><wsdl:message name="IFirPlcy_CiiRegPlcyPay_OutputMessage"><wsdl:part name="parameters" element="tns:CiiRegPlcyPayResponse"/></wsdl:message><wsdl:message name="IFirPlcy_CiiRegPrps_InputMessage"><wsdl:part name="parameters" element="tns:CiiRegPrps"/></wsdl:message><wsdl:message name="IFirPlcy_CiiRegPrps_OutputMessage"><wsdl:part name="parameters" element="tns:CiiRegPrpsResponse"/></wsdl:message><wsdl:portType name="IFirPlcy"><wsdl:operation name="CiiRegPlcy"><wsdl:input wsaw:Action="http://tempuri.org/IFirPlcy/CiiRegPlcy" message="tns:IFirPlcy_CiiRegPlcy_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IFirPlcy/CiiRegPlcyResponse" message="tns:IFirPlcy_CiiRegPlcy_OutputMessage"/></wsdl:operation><wsdl:operation name="CiiRegDocLos"><wsdl:input wsaw:Action="http://tempuri.org/IFirPlcy/CiiRegDocLos" message="tns:IFirPlcy_CiiRegDocLos_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IFirPlcy/CiiRegDocLosResponse" message="tns:IFirPlcy_CiiRegDocLos_OutputMessage"/></wsdl:operation><wsdl:operation name="CiiRegDocLosSts"><wsdl:input wsaw:Action="http://tempuri.org/IFirPlcy/CiiRegDocLosSts" message="tns:IFirPlcy_CiiRegDocLosSts_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IFirPlcy/CiiRegDocLosStsResponse" message="tns:IFirPlcy_CiiRegDocLosSts_OutputMessage"/></wsdl:operation><wsdl:operation name="CiiRegDocLosEvl"><wsdl:input wsaw:Action="http://tempuri.org/IFirPlcy/CiiRegDocLosEvl" message="tns:IFirPlcy_CiiRegDocLosEvl_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IFirPlcy/CiiRegDocLosEvlResponse" message="tns:IFirPlcy_CiiRegDocLosEvl_OutputMessage"/></wsdl:operation><wsdl:operation name="CiiRegLos"><wsdl:input wsaw:Action="http://tempuri.org/IFirPlcy/CiiRegLos" message="tns:IFirPlcy_CiiRegLos_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IFirPlcy/CiiRegLosResponse" message="tns:IFirPlcy_CiiRegLos_OutputMessage"/></wsdl:operation><wsdl:operation name="CiiRegLosOs"><wsdl:input wsaw:Action="http://tempuri.org/IFirPlcy/CiiRegLosOs" message="tns:IFirPlcy_CiiRegLosOs_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IFirPlcy/CiiRegLosOsResponse" message="tns:IFirPlcy_CiiRegLosOs_OutputMessage"/></wsdl:operation><wsdl:operation name="CiiRegCmpCntrct"><wsdl:input wsaw:Action="http://tempuri.org/IFirPlcy/CiiRegCmpCntrct" message="tns:IFirPlcy_CiiRegCmpCntrct_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IFirPlcy/CiiRegCmpCntrctResponse" message="tns:IFirPlcy_CiiRegCmpCntrct_OutputMessage"/></wsdl:operation><wsdl:operation name="CiiRegPlcyTrn"><wsdl:input wsaw:Action="http://tempuri.org/IFirPlcy/CiiRegPlcyTrn" message="tns:IFirPlcy_CiiRegPlcyTrn_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IFirPlcy/CiiRegPlcyTrnResponse" message="tns:IFirPlcy_CiiRegPlcyTrn_OutputMessage"/></wsdl:operation><wsdl:operation name="CiiRegPlcyPay"><wsdl:input wsaw:Action="http://tempuri.org/IFirPlcy/CiiRegPlcyPay" message="tns:IFirPlcy_CiiRegPlcyPay_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IFirPlcy/CiiRegPlcyPayResponse" message="tns:IFirPlcy_CiiRegPlcyPay_OutputMessage"/></wsdl:operation><wsdl:operation name="CiiRegPrps"><wsdl:input wsaw:Action="http://tempuri.org/IFirPlcy/CiiRegPrps" message="tns:IFirPlcy_CiiRegPrps_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IFirPlcy/CiiRegPrpsResponse" message="tns:IFirPlcy_CiiRegPrps_OutputMessage"/></wsdl:operation></wsdl:portType><wsdl:binding name="myBasicHttpBinding_IFirPlcy" type="tns:IFirPlcy"><soap:binding transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="CiiRegPlcy"><soap:operation soapAction="http://tempuri.org/IFirPlcy/CiiRegPlcy" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="CiiRegDocLos"><soap:operation soapAction="http://tempuri.org/IFirPlcy/CiiRegDocLos" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="CiiRegDocLosSts"><soap:operation soapAction="http://tempuri.org/IFirPlcy/CiiRegDocLosSts" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="CiiRegDocLosEvl"><soap:operation soapAction="http://tempuri.org/IFirPlcy/CiiRegDocLosEvl" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="CiiRegLos"><soap:operation soapAction="http://tempuri.org/IFirPlcy/CiiRegLos" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="CiiRegLosOs"><soap:operation soapAction="http://tempuri.org/IFirPlcy/CiiRegLosOs" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="CiiRegCmpCntrct"><soap:operation soapAction="http://tempuri.org/IFirPlcy/CiiRegCmpCntrct" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="CiiRegPlcyTrn"><soap:operation soapAction="http://tempuri.org/IFirPlcy/CiiRegPlcyTrn" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="CiiRegPlcyPay"><soap:operation soapAction="http://tempuri.org/IFirPlcy/CiiRegPlcyPay" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="CiiRegPrps"><soap:operation soapAction="http://tempuri.org/IFirPlcy/CiiRegPrps" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding><wsdl:service name="FirPlcy"><wsdl:port name="myBasicHttpBinding_IFirPlcy" binding="tns:myBasicHttpBinding_IFirPlcy"><soap:address location="http://reinsure.centinsur.ir/FirLogicV4_2Test"/></wsdl:port></wsdl:service></wsdl:definitions>