sanhab-templates/Fire/Fire-Register-Policy-soapTemplate.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/" xmlns:fir="http://schemas.datacontract.org/2004/07/FirLogic.DataModel">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:CiiRegPlcy>
         <!--Optional:-->
         <tem:Pr>
            <!--Optional:-->
            <fir:AgncFldCod>?</fir:AgncFldCod>
            <!--Optional:-->
            <fir:BgnDte>?</fir:BgnDte>
            <!--Optional:-->
            <fir:BrkrFldCod>?</fir:BrkrFldCod>
            <!--Optional:-->
            <fir:BrnhFldCod>?</fir:BrnhFldCod>
            <!--Optional:-->
            <fir:CmpCntrctCod>?</fir:CmpCntrctCod>
            <!--Optional:-->
            <fir:Cptl>?</fir:Cptl>
            <!--Optional:-->
            <fir:CptlCurCod>?</fir:CptlCurCod>
            <!--Optional:-->
            <fir:CptlLmt>?</fir:CptlLmt>
            <!--Optional:-->
            <fir:CptlLmtCurCod>?</fir:CptlLmtCurCod>
            <!--Optional:-->
            <fir:CptlRsk>?</fir:CptlRsk>
            <!--Optional:-->
            <fir:CurCod>?</fir:CurCod>
            <!--Optional:-->
            <fir:CurrencySource>?</fir:CurrencySource>
            <!--Optional:-->
            <fir:EdrsCod>?</fir:EdrsCod>
            <!--Optional:-->
            <fir:EdrsCusCod>?</fir:EdrsCusCod>
            <!--Optional:-->
            <fir:EdrsDscr>?</fir:EdrsDscr>
            <!--Optional:-->
            <fir:EdrsEffectDate>?</fir:EdrsEffectDate>
            <!--Optional:-->
            <fir:EdrsFirPlcyCod>?</fir:EdrsFirPlcyCod>
            <!--Optional:-->
            <fir:EdrsTypCod>?</fir:EdrsTypCod>
            <!--Optional:-->
            <fir:EndDte>?</fir:EndDte>
            <!--Optional:-->
            <fir:FixRte>?</fir:FixRte>
            <!--Optional:-->
            <fir:InsurancePremiumRate>?</fir:InsurancePremiumRate>
            <!--Optional:-->
            <fir:IntrAgncFldCod>?</fir:IntrAgncFldCod>
            <!--Optional:-->
            <fir:IntrBrnhFldCod>?</fir:IntrBrnhFldCod>
            <!--Optional:-->
            <fir:IsFrstLos>?</fir:IsFrstLos>
            <!--Optional:-->
            <fir:IsGrp>?</fir:IsGrp>
            <!--Optional:-->
            <fir:IsMrg>?</fir:IsMrg>
            <!--Optional:-->
            <fir:IsPayAtOnce>?</fir:IsPayAtOnce>
            <!--Optional:-->
            <fir:IsRsl>?</fir:IsRsl>
            <!--Optional:-->
            <fir:IsSts>?</fir:IsSts>
            <!--Optional:-->
            <fir:IsuDte>?</fir:IsuDte>
            <!--Optional:-->
            <fir:LdrCmpCod>?</fir:LdrCmpCod>
            <!--Optional:-->
            <fir:LdrCmpDocNo>?</fir:LdrCmpDocNo>
            <!--Optional:-->
            <fir:MapFldDtlCod>?</fir:MapFldDtlCod>
            <!--Optional:-->
            <fir:PlcyCns>
				${PlcyCns}
            </fir:PlcyCns>
            <!--Optional:-->
            <fir:PlcyCvr>
				${PlcyCvr}
            </fir:PlcyCvr>
            <!--Optional:-->
            <fir:PlcyExc>?</fir:PlcyExc>
            <!--Optional:-->
            <fir:PlcyGoodsGroups>
				${PlcyGoodsGroups}
            </fir:PlcyGoodsGroups>
            <!--Optional:-->
            <fir:PlcyIns>
				${PlcyIns}
            </fir:PlcyIns>
            <!--Optional:-->
            <fir:PlcyInsrd>
				${PlcyInsrd}
            </fir:PlcyInsrd>
            <!--Optional:-->
            <fir:PlcyPay>
				${PlcyPay}
            </fir:PlcyPay>
            <!--Optional:-->
            <fir:PlcyTypCod>?</fir:PlcyTypCod>
            <!--Optional:-->
            <fir:PrdInsDay>?</fir:PrdInsDay>
            <!--Optional:-->
            <fir:Prm>?</fir:Prm>
            <!--Optional:-->
            <fir:PrntEdrsCmpDocNo>?</fir:PrntEdrsCmpDocNo>
            <!--Optional:-->
            <fir:PrntPlcyCmpDocNo>?</fir:PrntPlcyCmpDocNo>
            <!--Optional:-->
            <fir:PrntPrpsCmpDocNo>?</fir:PrntPrpsCmpDocNo>
            <!--Optional:-->
            <fir:PrpsFirPlcyCod>?</fir:PrpsFirPlcyCod>
            <!--Optional:-->
            <fir:PrtAprvDte>?</fir:PrtAprvDte>
            <!--Optional:-->
            <fir:PrtAprvNo>?</fir:PrtAprvNo>
            <!--Optional:-->
            <fir:RqsCod>?</fir:RqsCod>
            <!--Optional:-->
            <fir:RqsIsuDte>?</fir:RqsIsuDte>
            <!--Optional:-->
            <fir:RqsTtl>?</fir:RqsTtl>
            <!--Optional:-->
            <fir:RqsVldDte>?</fir:RqsVldDte>
            <!--Optional:-->
            <fir:RslCnt>?</fir:RslCnt>
            <!--Optional:-->
            <fir:Tax>?</fir:Tax>
            <!--Optional:-->
            <fir:Tol>?</fir:Tol>
            <!--Optional:-->
            <fir:WbsEdrsCod>?</fir:WbsEdrsCod>
            <!--Optional:-->
            <fir:WbsPlcyCod>?</fir:WbsPlcyCod>
         </tem:Pr>
         <!--Optional:-->
         <tem:Username>?</tem:Username>
         <!--Optional:-->
         <tem:Password>?</tem:Password>
      </tem:CiiRegPlcy>
   </soapenv:Body>
</soapenv:Envelope>