sanhab-templates/Fire/Fire-Register-Proposal-soapTemplate.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/" xmlns:fir="http://schemas.datacontract.org/2004/07/FirLogic.DataModel">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:CiiRegPrps>
         <!--Optional:-->
         <tem:PrpsReq>
            <!--Optional:-->
            <fir:AgncFldCod>${AgncFldCod}</fir:AgncFldCod>
            <!--Optional:-->
            <fir:BgnDte>${BgnDte}</fir:BgnDte>
            <!--Optional:-->
            <fir:BrkrFldCod>${BrkrFldCod}</fir:BrkrFldCod>
            <!--Optional:-->
            <fir:BrnhFldCod>${BrnhFldCod}</fir:BrnhFldCod>
            <!--Optional:-->
            <fir:CmpCntrctCod>${CmpCntrctCod}</fir:CmpCntrctCod>
            <!--Optional:-->
            <fir:Cptl>${Cptl}</fir:Cptl>
            <!--Optional:-->
            <fir:CptlCurCod>${CptlCurCod}</fir:CptlCurCod>
            <!--Optional:-->
            <fir:CptlLmt>${CptlLmt}</fir:CptlLmt>
            <!--Optional:-->
            <fir:CptlLmtCurCod>${CptlLmtCurCod}</fir:CptlLmtCurCod>
            <!--Optional:-->
            <fir:CptlRsk>${CptlRsk}</fir:CptlRsk>
            <!--Optional:-->
            <fir:CurCod>${CurCod}</fir:CurCod>
            <!--Optional:-->
            <fir:CurrencySource>${CurrencySource}</fir:CurrencySource>
            <!--Optional:-->
            <fir:EdrsCusCod>${EdrsCusCod}</fir:EdrsCusCod>
            <!--Optional:-->
            <fir:EdrsDscr>${EdrsDscr}</fir:EdrsDscr>
            <!--Optional:-->
            <fir:EdrsEffectDate>${EdrsEffectDate}</fir:EdrsEffectDate>
            <!--Optional:-->
            <fir:EdrsFirPlcyCod>${EdrsFirPlcyCod}</fir:EdrsFirPlcyCod>
            <!--Optional:-->
            <fir:EdrsTypCod>${EdrsTypCod}</fir:EdrsTypCod>
            <!--Optional:-->
            <fir:EndDte>${EndDte}</fir:EndDte>
            <!--Optional:-->
            <fir:FixRte>${FixRte}</fir:FixRte>
            <!--Optional:-->
            <fir:InsurancePremiumRate>${InsurancePremiumRate}</fir:InsurancePremiumRate>
            <!--Optional:-->
            <fir:IntrAgncFldCod>${IntrAgncFldCod}</fir:IntrAgncFldCod>
            <!--Optional:-->
            <fir:IntrBrnhFldCod>${IntrBrnhFldCod}</fir:IntrBrnhFldCod>
            <!--Optional:-->
            <fir:IsFrstLos>${IsFrstLos}</fir:IsFrstLos>
            <!--Optional:-->
            <fir:IsGrp>${IsGrp}</fir:IsGrp>
            <!--Optional:-->
            <fir:IsMrg>${IsMrg}</fir:IsMrg>
            <!--Optional:-->
            <fir:IsPayAtOnce>${IsPayAtOnce}</fir:IsPayAtOnce>
            <!--Optional:-->
            <fir:IsRsl>${IsRsl}</fir:IsRsl>
            <!--Optional:-->
            <fir:IsSts>${IsSts}</fir:IsSts>
            <!--Optional:-->
            <fir:IsuDte>${IsuDte}</fir:IsuDte>
            <!--Optional:-->
            <fir:LdrCmpCod>${LdrCmpCod}</fir:LdrCmpCod>
            <!--Optional:-->
            <fir:LdrCmpDocNo>${LdrCmpDocNo}</fir:LdrCmpDocNo>
            <!--Optional:-->
            <fir:MapFldDtlCod>${MapFldDtlCod}</fir:MapFldDtlCod>
            <!--Optional:-->
            <fir:PlcyCns>
               ${PlcyCns}
            </fir:PlcyCns>
            <!--Optional:-->
            <fir:PlcyCvr>
				${PlcyCvr}
            </fir:PlcyCvr>
            <!--Optional:-->
            <fir:PlcyExc>${PlcyExc}</fir:PlcyExc>
            <!--Optional:-->
            <fir:PlcyGoodsGroups>
              ${PlcyGoodsGroups}
            </fir:PlcyGoodsGroups>
            <!--Optional:-->
            <fir:PlcyIns>
               ${FirPlcyIns}
            </fir:PlcyIns>
            <!--Optional:-->
            <fir:PlcyInsrd>
			   ${PlcyInsrId}
            </fir:PlcyInsrd>
            <!--Optional:-->
            <fir:PlcyPay>
               ${PlcyPay}
            </fir:PlcyPay>
            <!--Optional:-->
            <fir:PlcyTypCod>${PlcyTypCod}</fir:PlcyTypCod>
            <!--Optional:-->
            <fir:PrdInsDay>${PrdInsDay}</fir:PrdInsDay>
            <!--Optional:-->
            <fir:Prm>${Prm}</fir:Prm>
            <!--Optional:-->
            <fir:PrntEdrsCmpDocNo>${PrntEdrsCmpDocNo}</fir:PrntEdrsCmpDocNo>
            <!--Optional:-->
            <fir:PrntPlcyCmpDocNo>${PrntPlcyCmpDocNo}</fir:PrntPlcyCmpDocNo>
            <!--Optional:-->
            <fir:PrntPrpsCmpDocNo>${PrntPrpsCmpDocNo}</fir:PrntPrpsCmpDocNo>
            <!--Optional:-->
            <fir:PrtAprvDte>${PrtAprvDte}</fir:PrtAprvDte>
            <!--Optional:-->
            <fir:PrtAprvNo>${PrtAprvNo}</fir:PrtAprvNo>
            <!--Optional:-->
            <fir:RqsCod>${RqsCod}</fir:RqsCod>
            <!--Optional:-->
            <fir:RqsIsuDte>${RqsIsuDte}</fir:RqsIsuDte>
            <!--Optional:-->
            <fir:RqsTtl>${RqsTtl}</fir:RqsTtl>
            <!--Optional:-->
            <fir:RqsVldDte>${RqsVldDte}</fir:RqsVldDte>
            <!--Optional:-->
            <fir:RslCnt>${RslCnt}</fir:RslCnt>
            <!--Optional:-->
            <fir:Tax>${Tax}</fir:Tax>
            <!--Optional:-->
            <fir:Tol>${Tol}</fir:Tol>
            <!--Optional:-->
            <fir:WbsEdrsCod>${WbsEdrsCod}</fir:WbsEdrsCod>
            <!--Optional:-->
            <fir:WbsPlcyCod>${WbsPlcyCod}</fir:WbsPlcyCod>
         </tem:PrpsReq>
         <!--Optional:-->
         <tem:Username>${Username}</tem:Username>
         <!--Optional:-->
         <tem:Password>${PassWrod}</tem:Password>
      </tem:CiiRegPrps>
   </soapenv:Body>
</soapenv:Envelope>